Revit 2027 API
PanelTypeSet.Contains Method
Tests for the existence of a panel type within the set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual bool Contains(
	PanelType item
)
Public Overridable Function Contains (
	item As PanelType
) As Boolean
public:
virtual bool Contains(
	PanelType^ item
)
abstract Contains :
        item : PanelType -> bool
override Contains :
        item : PanelType -> bool
Parameters
item PanelType
The panel type to be searched for.
Return Value
Boolean
The Contains method returns True if the panel type is within the set, otherwise False.
See Also
Reference
PanelTypeSet Class
Autodesk.Revit.DB Namespace